eisup_2019_docmng_integration/src/Documents/абс_КапитализацияПроцентов/абс_КапитализацияПроцентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_КапитализацияПроцентов</name>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоБУ</registerRecords>
  <registerRecords>AccumulationRegister.абс_НезавершенноеПроизводствоНУ</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.абс_КапитализацияПроцентовПоОС</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПроцентов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяПрочихДоходовИРасходовНУ</name>
    <type>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРаспределения</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНУ</name>
      <type>
        <types>ChartOfAccountsRef.Налоговый</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанкСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчетаПоПБУ18</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартийНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_КапитализацияПроцентовПоОС/абс_КапитализацияПроцентовПоОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_КапитализацияПроцентовПоОС</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыУчетаПоПБУ18/ВидыУчетаПоПБУ18.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетаПоПБУ18</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НУ</name>
    <comment>Налоговый учет</comment>
  </enumValues>
  <enumValues>
    <name>ПР</name>
    <comment>Учет постоянных разниц</comment>
  </enumValues>
  <enumValues>
    <name>ВР</name>
    <comment>Учет временных разниц</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_КапитализацияПроцентов/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мТекущийПользователь;
Перем мРолиПользователя;
Перем мУдалятьДвижения;


Процедура ДвиженияПоРегистрам()
	
	ТаблицаДвиженийБУ = Движения.Хозрасчетный.Выгрузить();
	ТаблицаДвиженийБУ.Очистить();
	
	ТаблицаДвиженийНУ = Движения.Налоговый.Выгрузить();
	ТаблицаДвиженийНУ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КапитализацияПроцентов.Организация,
	|	КапитализацияПроцентов.Дата КАК Период,
	|	КапитализацияПроцентов.Ссылка КАК Регистратор,
	|	КапитализацияПроцентов.СчетПроцентов КАК СчетКт,
	|	КапитализацияПроцентов.Субконто1 КАК СубконтоКт1,
	|	КапитализацияПроцентовТаблицаРаспределения.НомерСтроки,
	|	КапитализацияПроцентовТаблицаРаспределения.Счет КАК СчетДт,
	|	КапитализацияПроцентовТаблицаРаспределения.СчетНУ КАК СчетДтНУ,
	|	КапитализацияПроцентовТаблицаРаспределения.Субконто1 КАК СубконтоДт1,
	|	КапитализацияПроцентовТаблицаРаспределения.Субконто2 КАК СубконтоДт2,
	|	КапитализацияПроцентовТаблицаРаспределения.Субконто3 КАК СубконтоДт3,
	|	КапитализацияПроцентовТаблицаРаспределения.Сумма,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Документ.абс_КапитализацияПроцентов.ТаблицаРаспределения КАК КапитализацияПроцентовТаблицаРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.абс_КапитализацияПроцентов КАК КапитализацияПроцентов
	|		ПО КапитализацияПроцентовТаблицаРаспределения.Ссылка = КапитализацияПроцентов.Ссылка
	|ГДЕ
	|	КапитализацияПроцентов.Ссылка = &Ссылка";
	ТаблицаДокумента = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого СтрТаб Из ТаблицаДокумента Цикл
		// БУ
		ПроводкаБУ = ТаблицаДвиженийБУ.Добавить();
		
		ЗаполнитьЗначенияСвойств(ПроводкаБУ, СтрТаб);
		//АБС ИЗМЕНЕНИЕ 39866  19.03.2014 17:56:51  Шамов
		//ПроводкаБУ.ВидСубконтоКт1 = СтрТаб.СчетКт.ВидыСубконто[0].ВидСубконто;
		//
		//ПроводкаБУ.ВидСубконтоДт1 = СтрТаб.СчетДт.ВидыСубконто[0].ВидСубконто;
		//ПроводкаБУ.ВидСубконтоДт2 = СтрТаб.СчетДт.ВидыСубконто[1].ВидСубконто;
		//ПроводкаБУ.ВидСубконтоДт3 = СтрТаб.СчетДт.ВидыСубконто[2].ВидСубконто;
		Если СтрТаб.СчетКт.ВидыСубконто.Количество() > 0 Тогда
			ПроводкаБУ.ВидСубконтоКт1 = СтрТаб.СчетКт.ВидыСубконто[0].ВидСубконто;
		КонецЕсли;
		
		Для Сч = 0 По СтрТаб.СчетДт.ВидыСубконто.Количество()-1 Цикл 		
			ПроводкаБУ["ВидСубконтоДт"+Строка(Сч+1)] = СтрТаб.СчетДт.ВидыСубконто[Сч].ВидСубконто;
		КонецЦикла;
		//АБС ИЗМЕНЕНИЕ 39866 КОНЕЦ
		
		//НУ
		ПроводкаНУ = ТаблицаДвиженийНУ.Добавить();
		
		ЗаполнитьЗначенияСвойств(ПроводкаНУ, СтрТаб,, "СчетКт, СубконтоКт1");
		
		ПроводкаНУ.СчетДт = СтрТаб.СчетДтНУ;
		
		ПроводкаНУ.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ВР;
		
		//АБС ИЗМЕНЕНИЕ 39866  19.03.2014 17:56:51  Шамов
		//ПроводкаНУ.ВидСубконтоДт1 = СтрТаб.СчетДтНУ.ВидыСубконто[0].ВидСубконто;
		//ПроводкаНУ.ВидСубконтоДт2 = СтрТаб.СчетДтНУ.ВидыСубконто[1].ВидСубконто;
		//ПроводкаНУ.ВидСубконтоДт3 = СтрТаб.СчетДтНУ.ВидыСубконто[2].ВидСубконто;
		Для Сч = 0 По СтрТаб.СчетДтНУ.ВидыСубконто.Количество()-1 Цикл 		
			ПроводкаНУ["ВидСубконтоДт"+Строка(Сч+1)] = СтрТаб.СчетДтНУ.ВидыСубконто[Сч].ВидСубконто;
		КонецЦикла;
		//АБС ИЗМЕНЕНИЕ 39866 КОНЕЦ
		
		
		Запись = Движения.абс_КапитализацияПроцентовПоОС.ДобавитьПриход();
		
		Запись.Регистратор 				= Ссылка;
		Запись.Период					= Дата;
		Запись.Активность				= Истина;
		
		Запись.Организация 				= Организация;
		Запись.ОбъектСтроительства 		= СтрТаб.СубконтоДт1;
		Запись.СтатьяДоходовРасходов 	= СтатьяПрочихДоходовИРасходовНУ;
		
		Запись.Сумма 					= СтрТаб.Сумма;			
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Загрузить(ТаблицаДвиженийБУ);
	Движения.Хозрасчетный.Записывать = Истина;	
	
	Движения.Налоговый.Загрузить(ТаблицаДвиженийНУ);
	Движения.Налоговый.Записывать = Истина;
	
	Движения.абс_КапитализацияПроцентовПоОС.Записывать = Истина;
		
	
	//
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДокумента,ТаблицаДвиженийБУ);
	//ТаблицаДвиженийБУ.ЗаполнитьЗначения(СчетПроцентов.ВидыСубконто[0].ВидСубконто,"ВидСубконтоКт1");
	//Для каждого СтрокаДвижений из ТаблицаДвиженийБУ Цикл
	//	СтрокаДвижений.ВидСубконтоДт1 = СтрокаДвижений.СчетДт.ВидыСубконто[0].ВидСубконто;
	//	СтрокаДвижений.ВидСубконтоДт2 = СтрокаДвижений.СчетДт.ВидыСубконто[1].ВидСубконто;
	//	СтрокаДвижений.ВидСубконтоДт3 = СтрокаДвижений.СчетДт.ВидыСубконто[2].ВидСубконто;
	//КонецЦикла;
	//Движения.Хозрасчетный.Загрузить(ТаблицаДвиженийБУ);
	//Движения.Хозрасчетный.Записать();
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Регистратор",Ссылка);
	//Запрос.УстановитьПараметр("Организация",Организация);
	//Запрос.УстановитьПараметр("Счет0811",СчетПроцентов);
	//
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	//|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	//|	СУММА(ХозрасчетныйДвиженияССубконто.Сумма) КАК Сумма
	//|ИЗ
	//|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	//|			,
	//|			,
	//|			Регистратор = &Регистратор
	//|				И СчетКт = &Счет0811
	//|				И Организация = &Организация,
	//|			,
	//|			) КАК ХозрасчетныйДвиженияССубконто
	//|ГДЕ
	//|	ХозрасчетныйДвиженияССубконто.Регистратор = &Регистратор
	//|	И ХозрасчетныйДвиженияССубконто.СчетКт = &Счет0811
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ХозрасчетныйДвиженияССубконто.СубконтоДт1,
	//|	ХозрасчетныйДвиженияССубконто.СубконтоКт1
	//|ИТОГИ
	//|	СУММА(Сумма)
	//|ПО
	//|	СубконтоКт1,
	//|	СубконтоДт1";
	//Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); //Группировка по статьям затрат
	////ПроводкиНУ = РегистрыБухгалтерии.Налоговый.СоздатьНаборЗаписей();
	//ПроводкиНУ = Движения.Налоговый;
	//ПроводкиНУ.Отбор.Регистратор.Установить(Ссылка);
	//Счет9102С = ПланыСчетов.Налоговый.НайтиПоКоду("91.02.С");
	//Пока Выборка.Следующий() Цикл
	//	Проводка = ПроводкиНУ.Добавить();
	//	Проводка.Период = Дата;
	//	Проводка.Регистратор = Ссылка;
	//	Проводка.Организация = Организация;
	//	//Проводка.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ВР;
	//	Проводка.СчетКт = Счет9102С;
	//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ПрочиеДоходыИРасходы",Выборка.СубконтоКт1 );
	//	Проводка.Сумма = -Выборка.Сумма;
	//	Проводка.Содержание = "Капитализация процентов";
	//	ВыборкаОбъекты = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	//	Пока ВыборкаОбъекты.Следующий() Цикл
	//		Проводка = ПроводкиНУ.Добавить();
	//		Проводка.Период = Дата;
	//		Проводка.Регистратор = Ссылка;
	//		Проводка.Организация = Организация;
	//		Проводка.ВидУчетаДт = Перечисления.ВидыУчетаПоПБУ18.ВР;
	//		Проводка.СчетДт = Счет9102С;
	//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОбъектыСтроительства",ВыборкаОбъекты.СубконтоДт1 );
	//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрочиеДоходыИРасходы",ВыборкаОбъекты.СубконтоКт1 );
	//		Проводка.Сумма = -ВыборкаОбъекты.Сумма;
	//		Проводка.Содержание = "Распределение капитализации по объектам";
	//	КонецЦикла;
	//КонецЦикла;
	//ПроводкиНУ.Записать();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, Истина, РежимПроведения);
	КонецЕсли;
	ДвиженияПоРегистрам();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	//НалоговыйУчетУСН.ЗаполнитьНастройкуКУДиР(ЭтотОбъект);

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

// Заполним список статусов для определения минимального статуса документа
мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
мРолиПользователя.Добавить(Справочники.РолиИсполнителей.ПустаяСсылка());
